//=============================================================================
//
//	爆発処理 [explosion.h]
//	Author : SHUMA AIZU
// 
//=============================================================================

#ifndef _EXPLOSION_H_
#define _EXPLOSION_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define EXPLOSION_SIZEX		(30)		//爆発のサイズX
#define EXPLOSION_SIZEY		(30)		//爆発のサイズY

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitExplosion(void);
void UninitExplosion(void);
void UpdateExplosion(void);
void DrawExplosion(void);
void SetExplosion(D3DXVECTOR3 pos, D3DXCOLOR col);

#endif
