//=============================================================================
//
//	ランキング画面処理 [ranking.h]
//	Author : SHUMA AIZU
// 
//=============================================================================

#ifndef _FRAME_H_
#define _FRAME_H_

#include "main.h"

// タイトル構造体の定義

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitFrame(void);
void UninitFrame(void);
void UpdateFrame(void);
void DrawFrame(void);

#endif
