//=============================================================================
//
//	ゲーム画面処理 [game.h]
//	Author : SHUMA AIZU
// 
//=============================================================================

#ifndef _GAME_H_
#define _GAME_H_

#include "main.h"

//*****************************************************************************
// ゲーム終了条件
//*****************************************************************************
typedef enum
{
	GAMEEND_CLEAR = 0,		// 勝利
	GAMEEND_GAMEOVER,		// 敗北
	GAMEEND_MAX
}GAMEEND;


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitGame(void);
void UninitGame(void);
void UpdateGame(void);
void DrawGame(void);
GAMEEND GetGameEnd(void);

#endif