//=============================================================================
//
//	マーカー処理 [marker.h]
//	Author : SHUMA AIZU
// 
//=============================================================================

#ifndef _MARKER_H_
#define _MARKER_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MARKER_SIZEX			(15.0f)		// マーカーのサイズX
#define MARKER_SIZEY			(15.0f)		// マーカーのサイズY
#define MARKER_DIFF				(100.0f)	// マーカーが出るまでの距離
#define MARKER_DIFF_A			(250.0f)	// 敵までの距離(近い)
#define MARKER_DIFF_B			(500.0f)	// 敵までの距離(普通)
#define MARKER_DIFF_C			(640.0f)	// 敵までの距離(遠い)
	
//*****************************************************************************
// マーカーの構造体定義
//*****************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;		// 位置
	bool bUse;				// 使用状態
}Marker;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitMarker(void);
void UninitMarker(void);
void UpdateMarker(void);
void DrawMarker(void);

#endif