//=============================================================================
//
//	パワーアップ処理 [powerup.h]
//	Author : SHUMA AIZU
// 
//=============================================================================

#ifndef _POWERUP_H_
#define _POWERUP_H_

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitPowerup(void);
void UninitPowerup(void);
void UpdatePowerup(void);
void DrawPowerup(void);

#endif // _POWERUP_H_