//=============================================================================
//
//	スコア処理 [score.h]
//	Author : SHUMA AIZU
// 
//=============================================================================

#ifndef _SCORE_H_
#define _SCORE_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define INIT_SCORE		(5000)				// スコアの初期値

//*****************************************************************************
// スコアUIの種類
//*****************************************************************************
typedef enum
{
	SCOREUI_GAGE = 0,		// スコア総量
	SCOREUI_CURTAIN,		// 現在スコア
	SCOREUI_SCALE,			// メーター
	SCOREUI_MAX
}SCOREUI;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitScore(void);
void UninitScore(void);
void UpdateScore(void);
void DrawScore(void);
void SetScore(int nScore);
void AddScore(int nValue);
void SubScore(int nValue);
int GetScore(void);
void CollisionScoretoEnemy(void);

#endif
