//=============================================================================
//
//	タイトルメニュー処理 [selectlevel.h]
//	Author : SHUMA AIZU
// 
//=============================================================================

#ifndef _SELECTLEVEL_H_
#define _SELECTLEVEL_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// タイトルメニュー
//*****************************************************************************
typedef enum
{
	SELECTLEVEL_NORMAL = 0,
	SELECTLEVEL_HARD,
	SELECTLEVEL_MAX
}SELECTLEVEL;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitSelectLevel(void);
void UninitSelectLevel(void);
void UpdateSelectLevel(void);
void DrawSelectLevel(void);
void SetSelectLevel(SELECTLEVEL selectlevel);

#endif // _SELECTLEVEL_H_