//=============================================================================
//
//	タイトル背景処理 [titlebg.h]
//	Author : SHUMA AIZU
// 
//=============================================================================

#ifndef _TITLEBG_H_
#define _TITLEBG_H_

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitTitleBG(void);
void UninitTitleBG(void);
void UpdateTitleBG(void);
void DrawTitleBG(void);

#endif
