//=============================================================================
//
//	チュートリアル画面処理 [tutorial.h]
//	Author : SHUMA AIZU
// 
//=============================================================================

#ifndef _TUTORIAL_H_
#define _TUTORIAL_H_

#include "main.h"

//*****************************************************************************
// チュートリアル構造体の定義
//*****************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;
	bool bDisp;
}TUTORIAL;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitTutorial(void);
void UninitTutorial(void);
void UpdateTutorial(void);
void DrawTutorial(void);

#endif
